app/Http/Controllers/Admin/ProductController.php

select * from `products`
---

        $this->syncProductWithStripe($product);

        return redirect()->route('admin.products.index')->with('success', 'Producto creado con éxito.');