app/Http/Controllers/Admin/ReportController.php

select DATE(created_at) as date, SUM(total_price) as total_sales from `orders` where `created_at` between '2025-09-15' and '2025-10-15' group by `date` order by `date` desc
select product_id, SUM(quantity) as total_quantity from `order_items` where exists (select * from `orders` where `order_items`.`order_id` = `orders`.`id` and `created_at` between '2025-09-15' and '2025-10-15') group by `product_id` order by `total_quantity` desc limit 5
---
    public function salesReport(Request $request)
    {
        // Obtener el rango de fechas desde el formulario o usar el último mes por defecto
        $startDate = $request->input('start_date', Carbon::now()->subMonth()->toDateString());
        $endDate = $request->input('end_date', Carbon::now()->toDateString());

        // Obtener las ventas agrupadas por fecha dentro del rango seleccionado
        $sales = Order::selectRaw('DATE(created_at) as date, SUM(total_price) as total_sales')
            ->whereBetween('created_at', [$startDate, $endDate])
            ->groupBy('date')
            ->orderBy('date', 'desc')
            ->get();

        // Obtener los productos más vendidos dentro del rango seleccionado
        $topProducts = OrderItem::selectRaw('product_id, SUM(quantity) as total_quantity')
            ->whereHas('order', function($query) use ($startDate, $endDate) {
                $query->whereBetween('created_at', [$startDate, $endDate]);
            })
            ->groupBy('product_id')
            ->orderBy('total_quantity', 'desc')
            ->take(5) // Limitar a los 5 productos más vendidos
            ->with('product') // Traer los detalles del producto
            ->get();